Repository: harrysxu/MigraineNoteIOS
Catalog: migraine_note/migraine_note/Localizable.xcstrings
Source language: en
Languages: zh_hans, zh_hant

# settings.sync.encrypted
source: End-to-end encrypted
zh_hans: 端到端加密
zh_hant: 端到端加密

# settings.sync.private
source: Private database storage
zh_hans: 私有数据库存储
zh_hant: 私有數據庫存儲

# settings.sync.offline
source: Offline-first design
zh_hans: 离线优先设计
zh_hant: 離線優先設計

# settings.privacy
source: Privacy
zh_hans: 隐私保护
zh_hant: 隱私保護

# settings.privacy.icloud
source: Data stored only in your iCloud
zh_hans: 数据仅存储在您的iCloud账户
zh_hant: 數據僅存儲在您的iCloud賬戶

# settings.privacy.no.access
source: Developers cannot access your data
zh_hans: 开发者无法访问您的数据
zh_hant: 開發者無法訪問您的數據

# settings.privacy.no.third
source: No unauthorized third-party access
zh_hans: 未经授权的第三方无法访问
zh_hant: 未經授權的第三方無法訪問

# settings.privacy.medical
source: Medical data privacy compliant
zh_hans: 符合医疗数据隐私要求
zh_hant: 符合醫療數據隱私要求

# settings.sync.log
source: Sync Log
zh_hans: 同步日志
zh_hant: 同步日誌

# settings.sync.clear
source: Clear
zh_hans: 清除
zh_hant: 清除

# settings.sync.empty
source: No sync records
zh_hans: 暂无同步记录
zh_hant: 暫無同步記錄

# settings.sync.last
source: Last sync
zh_hans: 上次同步
zh_hant: 上次同步

# settings.sync.waiting
source: Waiting for first sync
zh_hans: 等待首次同步
zh_hant: 等待首次同步

# settings.sync.local.only
source: Data saved locally only
zh_hans: 数据仅保存在本地设备
zh_hant: 數據僅保存在本地設備

# settings.sync.retry
source: Sync issue encountered, will retry
zh_hans: 同步时遇到问题，将自动重试
zh_hant: 同步時遇到問題，將自動重試

# settings.sync.syncing
source: Syncing with iCloud...
zh_hans: 正在与iCloud同步数据...
zh_hant: 正在與iCloud同步數據...

# settings.sync.signin
source: Please sign in to iCloud in Settings
zh_hans: 请在系统设置中登录iCloud
zh_hant: 請在系統設置中登錄iCloud

# settings.sync.ready
source: Ready, waiting for first sync...
zh_hans: 已就绪，等待首次同步...
zh_hant: 已就緒，等待首次同步...

# settings.sync.checking
source: Checking iCloud status...
zh_hans: 检查iCloud状态中...
zh_hant: 檢查iCloud狀態中...

# settings.sync.last.prefix
source: Last sync: %@
zh_hans: 上次同步：%@
zh_hant: 上次同步：%@

# settings.restart.required
source: Restart Required
zh_hans: 需要重启应用
zh_hant: 需要重啟應用

# settings.restart.later
source: Later
zh_hans: 稍后
zh_hant: 稍後

# settings.restart.now
source: Restart Now
zh_hans: 立即重启
zh_hant: 立即重啟

# settings.restart.message
source: Sync settings have changed. You can restart later or restart now.
zh_hans: 更改同步设置后需要重启应用才能生效。您可以稍后手动重启，或现在立即重启。
zh_hant: 更改同步設置後需要重啟應用才能生效。您可以稍後手動重啟，或現在立即重啟。

# settings.sync.failed
source: Failed
zh_hans: 失败
zh_hant: 失敗

# settings.features.title
source: Features
zh_hans: 功能配置
zh_hant: 功能配置

# settings.features.toggle
source: Feature Toggles
zh_hans: 功能开关
zh_hant: 功能開關

# settings.tcm.features
source: TCM Features
zh_hans: 中医功能
zh_hant: 中醫功能

# settings.tcm.desc
source: Show TCM symptoms, triggers and analysis
zh_hans: 显示中医症状、诱因和证候分析
zh_hant: 顯示中醫症狀、誘因和證候分析

# settings.weather.tracking
source: Weather Tracking
zh_hans: 天气追踪
zh_hant: 天氣追蹤

# settings.weather.desc
source: Auto-record weather during attacks
zh_hans: 自动记录发作时的天气状况
zh_hant: 自動記錄發作時的天氣狀況

# settings.pain.score
source: Pain Score Method
zh_hans: 疼痛评分方式
zh_hant: 疼痛評分方式

# settings.pain.score.standard
source: Score Standard
zh_hans: 评分标准
zh_hant: 評分標準

# settings.pain.vas
source: VAS (0-10)
zh_hans: VAS视觉模拟评分（0-10）
zh_hant: VAS視覺模擬評分（0-10）

# settings.pain.nrs
source: NRS (0-10)
zh_hans: NRS数字评分（0-10）
zh_hant: NRS數字評分（0-10）

# settings.pain.footer
source: VAS and NRS are international pain scoring standards, both 0-10.
zh_hans: VAS和NRS都是国际通用的疼痛评分标准，范围均为0-10分。
zh_hant: VAS和NRS都是國際通用的疼痛評分標準，範圍均為0-10分。

# about.title
source: About
zh_hans: 关于
zh_hant: 關於

# about.version
source: Version %@ (%@)
zh_hans: 版本 %@ (%@)
zh_hant: 版本 %@ (%@)

# about.dev.hint
source: Tap icon 3 times to enter test mode
zh_hans: 连续点击图标3次可进入测试模式
zh_hant: 連續點擊圖標3次可進入測試模式

# about.intro
source: A professional migraine management tool based on IHS ICHD-3 and Chinese Migraine Guidelines 2024.
zh_hans: 一款专业的头痛管理工具，基于国际头痛学会（IHS）ICHD-3诊断标准和《中国偏头痛诊断与治疗指南2024版》开发。
zh_hant: 一款專業的頭痛管理工具，基於國際頭痛學會（IHS）ICHD-3診斷標準和《中國偏頭痛診斷與治療指南2024版》開發。

# about.features
source: Features
zh_hans: 主要特性
zh_hant: 主要特性

# about.feature.records
source: Complete recording workflow
zh_hans: 完整的发作记录流程
zh_hant: 完整的發作記錄流程

# about.feature.weather
source: WeatherKit weather tracking
zh_hans: WeatherKit天气追踪
zh_hant: WeatherKit天氣追蹤

# about.feature.moh
source: MOH risk detection
zh_hans: MOH风险智能检测
zh_hant: MOH風險智能檢測

# about.feature.analytics
source: Professional analytics
zh_hans: 专业的数据分析
zh_hant: 專業的數據分析

# about.feature.export
source: PDF medical report export
zh_hans: 医疗报告PDF导出
zh_hant: 醫療報告PDF導出

# about.feature.icloud
source: iCloud sync
zh_hans: iCloud跨设备同步
zh_hant: iCloud跨設備同步

# about.tech.ui
source: UI Framework
zh_hans: UI框架
zh_hant: UI框架

# about.tech.data
source: Data persistence
zh_hans: 数据持久化
zh_hant: 數據持久化

# about.tech.min
source: Minimum system
zh_hans: 最低系统要求
zh_hant: 最低系統要求

# about.privacy
source: Privacy commitment
zh_hans: 隐私承诺
zh_hant: 隱私承諾

# about.privacy.desc
source: All health data is stored only in your iCloud. No ads or tracking.
zh_hans: 您的所有健康数据仅存储在您的iCloud私有数据库，开发者和任何第三方都无法访问您的数据。本应用不含任何广告和追踪代码。
zh_hant: 您的所有健康數據僅存儲在您的iCloud私有數據庫，開發者和任何第三方都無法訪問您的數據。本應用不含任何廣告和追蹤代碼。

# about.guide
source: User Guide
zh_hans: 使用指南
zh_hant: 使用指南

# about.source
source: Source Code
zh_hans: 开源代码
zh_hant: 開源代碼

# about.contact
source: Contact Us
zh_hans: 联系我们
zh_hant: 聯絡我們

# about.intro.section
source: App Introduction
zh_hans: 应用介绍
zh_hant: 應用介紹

# about.tech.section
source: Tech Stack
zh_hans: 技术栈
zh_hant: 技術棧

# theme.select
source: Select Theme
zh_hans: 选择主题
zh_hant: 選擇主題

source: Theme Preview
zh_hans: 主题预览
zh_hant: 主題預覽

# theme.preview.footer
source: Preview theme effect
zh_hans: 预览当前主题下的界面效果
zh_hant: 預覽當前主題下的界面效果

# theme.attack.sample
source: Migraine Attack
zh_hans: 头痛发作
zh_hant: 頭痛發作

# theme.intensity.sample
source: Intensity 7
zh_hans: 强度 7
zh_hant: 強度 7

# theme.primary.btn
source: Primary
zh_hans: 主按钮
zh_hant: 主按鈕

# theme.secondary.btn
source: Secondary
zh_hans: 次按钮
zh_hant: 次按鈕

# theme.status.success
source: Success
zh_hans: 成功
zh_hant: 成功

# theme.status.warning
source: Warning
zh_hans: 警告
zh_hant: 警告

# theme.status.error
source: Error
zh_hans: 错误
zh_hant: 錯誤

# theme.status.info
source: Info
zh_hans: 信息
zh_hant: 信息

# theme.auto.adapt
source: Auto adapt
zh_hans: 自动适配
zh_hant: 自動適配

# theme.auto.desc
source: UI adapts to your theme
zh_hans: 界面会自动适配您选择的主题模式
zh_hant: 界面會自動適配您選擇的主題模式

# theme.eye.care
source: Eye care
zh_hans: 护眼设计
zh_hant: 護眼設計

# theme.eye.desc
source: Dark mode protects eyes in low light
zh_hans: 深色模式可在暗光环境下保护眼睛
zh_hant: 深色模式可在暗光環境下保護眼睛

# theme.follow.system
source: Follow system
zh_hans: 跟随系统
zh_hant: 跟隨系統

# theme.follow.desc
source: Switches with system time
zh_hans: 选择跟随系统时,将根据系统时间自动切换
zh_hant: 選擇跟隨系統時,將根據系統時間自動切換

# theme.description.section
source: Theme Description
zh_hans: 主题说明
zh_hant: 主題說明

# theme.settings.title
source: Theme Settings
zh_hans: 主题设置
zh_hant: 主題設置

# greeting.morning
source: Good Morning
zh_hans: 早安
zh_hant: 早安

# greeting.noon
source: Good Afternoon
zh_hans: 中午好
zh_hant: 中午好

# greeting.evening
source: Good Evening
zh_hans: 晚上好
zh_hant: 晚上好

# greeting.night
source: Late Night
zh_hans: 夜深了
zh_hant: 夜深了

# greeting.afternoon
source: Good Afternoon
zh_hans: 下午好
zh_hant: 下午好

# action.delete
source: Delete
zh_hans: 删除
zh_hant: 刪除

# toast.deleted
source: Record deleted
zh_hans: 记录已删除
zh_hant: 記錄已刪除

# toast.delete.failed
source: Delete failed, please try again
zh_hans: 删除失败，请重试
zh_hant: 刪除失敗，請重試

# action.start.record
source: Start Recording
zh_hans: 开始记录
zh_hant: 開始記錄

# action.edit.record
source: Edit Record
zh_hans: 编辑记录
zh_hant: 編輯記錄

# stats.attack.days.short
source: Attack days
zh_hans: 发作天数
zh_hant: 發作天數

# stats.acute.med.count
source: Acute meds
zh_hans: 急性用药次数
zh_hant: 急性用藥次數

# stats.acute.med.days
source: Acute med days
zh_hans: 急性用药天数
zh_hant: 急性用藥天數

# status.duration.format
source: %d h %d m
zh_hans: %d小时%d分钟
zh_hant: %d小時%d分鐘

# status.duration.minutes
source: %d min
zh_hans: %d分钟
zh_hant: %d分鐘

# attack.intensity
source: Intensity
zh_hans: 强度
zh_hant: 強度

# attack.medication.count
source: %d meds
zh_hans: %d次用药
zh_hant: %d次用藥

# timeline.medication.count
source: %d meds
zh_hans: %d次用药
zh_hant: %d次用藥

# filter.no.results
source: No matching records
zh_hans: 未找到匹配的记录
zh_hant: 未找到匹配的記錄

# filter.try.adjust
source: Try adjusting search or filters
zh_hans: 尝试调整搜索或筛选条件
zh_hant: 嘗試調整搜尋或篩選條件

# filter.record.type
source: Record Type
zh_hans: 记录类型
zh_hant: 記錄類型

# filter.sort
source: Sort
zh_hans: 排序方式
zh_hant: 排序方式

# filter.reset
source: Reset All Filters
zh_hans: 重置所有筛选
zh_hant: 重置所有篩選

# filter.type
source: Type
zh_hans: 类型
zh_hant: 類型

# filter.sort.label
source: Sort by
zh_hans: 排序
zh_hant: 排序

# form.pain.assessment.title
source: Pain Assessment
zh_hans: 疼痛评估
zh_hant: 疼痛評估

# form.symptoms.title
source: Symptom Record (%d)
zh_hans: 症状记录 (%d项)
zh_hant: 症狀記錄 (%d項)

# form.symptoms.title.empty
source: Symptom Record
zh_hans: 症状记录
zh_hant: 症狀記錄

# form.triggers.title
source: Trigger Analysis (%d)
zh_hans: 诱因分析 (%d项)
zh_hant: 誘因分析 (%d項)

# form.triggers.title.empty
source: Trigger Analysis
zh_hans: 诱因分析
zh_hant: 誘因分析

# form.medications.title
source: Medications (%d)
zh_hans: 用药记录 (%d项)
zh_hant: 用藥記錄 (%d項)

# form.medications.title.empty
source: Medications
zh_hans: 用药记录
zh_hant: 用藥記錄

# form.interventions.title
source: Interventions (%d)
zh_hans: 非药物干预 (%d项)
zh_hant: 非藥物干預 (%d項)

# form.interventions.title.empty
source: Interventions
zh_hans: 非药物干预
zh_hant: 非藥物干預

# form.notes.title
source: Notes
zh_hans: 备注
zh_hant: 備註

# form.notes.filled
source: Notes (filled)
zh_hans: 备注 (已填写)
zh_hant: 備註 (已填寫)

# form.has.aura.question
source: Has aura?
zh_hans: 是否有先兆？
zh_hant: 是否有先兆？

# form.symptoms.accompanying
source: Accompanying symptoms
zh_hans: 伴随症状
zh_hant: 伴隨症狀

# form.fill.suggestion.detail
source: Suggest filling pain intensity and location for better analysis
zh_hans: 建议填写疼痛强度和部位以获得更准确的分析
zh_hant: 建議填寫疼痛強度和部位以獲得更準確的分析

# form.complete.record
source: Complete Record
zh_hans: 完成记录
zh_hant: 完成記錄

# alert.confirm.cancel
source: Confirm Cancel
zh_hans: 确认取消
zh_hant: 確認取消

# action.continue.edit
source: Continue Editing
zh_hans: 继续编辑
zh_hant: 繼續編輯

# toast.save.success
source: Record saved
zh_hans: 记录保存成功
zh_hant: 記錄保存成功

# toast.save.failed
source: Save failed, please retry
zh_hans: 保存失败，请重试
zh_hant: 保存失敗，請重試

# profile.age.suffix
source: years
zh_hans: 岁
zh_hant: 歲

# about.weather.source
source: Weather Data Source
zh_hans: 天气数据来源
zh_hant: 天氣數據來源

# chart.month
source: Month
zh_hans: 月份
zh_hant: 月份

# chart.attack.days
source: Attack days
zh_hans: 发作天数
zh_hant: 發作天數

# chart.hour
source: Hour
zh_hans: 小时
zh_hant: 小時

# chart.start
source: Start
zh_hans: 起点
zh_hant: 起點

# chart.count
source: Count
zh_hans: 次数
zh_hant: 次數

# chart.phase
source: Phase
zh_hans: 阶段
zh_hant: 階段

# theme.date.sample
source: Feb 3, 2026 14:30
zh_hans: 2026年2月3日 14:30
zh_hant: 2026年2月3日 14:30

# accessibility.pain.none
source: No pain
zh_hans: 无疼痛
zh_hant: 無疼痛

# accessibility.pain.mild
source: Mild pain, %d points
zh_hans: 轻度疼痛，%d分
zh_hant: 輕度疼痛，%d分

# accessibility.pain.moderate
source: Moderate pain, %d points
zh_hans: 中度疼痛，%d分
zh_hant: 中度疼痛，%d分

# accessibility.pain.severe
source: Severe pain, %d points
zh_hans: 重度疼痛，%d分
zh_hant: 重度疼痛，%d分

# accessibility.pain.extreme
source: Extreme pain, 10 points
zh_hans: 极重度疼痛，10分
zh_hant: 極重度疼痛，10分

# accessibility.pain.score
source: %d points
zh_hans: %d分
zh_hant: %d分

# accessibility.duration.hours
source: %d hours
zh_hans: %d小时
zh_hant: %d小時

# accessibility.duration.minutes
source: %d minutes
zh_hans: %d分钟
zh_hant: %d分鐘

# accessibility.duration.underMinute
source: Less than 1 minute
zh_hans: 少于1分钟
zh_hant: 少於1分鐘

# weather.detail.humidity
source: Humidity
zh_hans: 湿度
zh_hant: 濕度

# weather.detail.windSpeed
source: Wind speed
zh_hans: 风速
zh_hant: 風速

# weather.detail.condition
source: Weather
zh_hans: 天气
zh_hant: 天氣

# weather.detail.location
source: Location
zh_hans: 位置
zh_hant: 位置

# component.collapse
source: Collapse
zh_hans: 收起
zh_hant: 收起

# component.viewDetails
source: View details
zh_hans: 查看详情
zh_hant: 查看詳情

# component.weather.attributionLink
source: Data source and attribution
zh_hans: 数据来源与归属
zh_hant: 數據來源與歸屬
